ednieuw/RTCcheck/Old/ESP32_CommV08_RTC01/ESP32_CommV08_RTC01.ino
/* 
 Author      : Ed Nieuwenhuijs ednieuw.nl
 Changes V001: Derived from ESP32Arduino_WordClockV098.ino
 Changes V002:  
 Changes V003: LED crashes with some rmt error. Runs on ESP32-S3-WROOM-DevKitC-1
 Changes V004: WIFI not connecting. Added in StartAPmode()  xTaskCreatePinnedToCore(WebServerTask,"WebServerTask", 4096, NULL, 1, NULL, 1 ); 
 Changes V005: WIFI not connecting. Added WS2812 and SK6812 LED-strip functionality to GPIO-pin 8 
 Changes V006: Equal to ESP32Arduino_WordClockV105.ino
 Changes V007: crashes when using EDSoftLED
 Changes V008: Equal to ESP32Arduino_WordClockV112.ino
 Changes V001: It runs

*********************
How to compile: 
Install Arduino ESP32 boards
Board: Arduino Nano ESP32 version 2.0.17 or ESP32 core 3.2.0 
Partition Scheme: With FAT
Pin Numbering: By GPIO number (legacy). Not 'By Arduino pin (default)'
*********************

ESP32-S3-WROOM-DevKitC-1
Option	    Value
Board:      ESP32-S3 DEV Module on ESP32 core 3.2.0 
USB         CDC on Boot	Enabled
USB Mode	  Hardware CDC and JTAG (or just Hardware CDC)
Upload Mode	UART0 / Hardware Serial
Flash Mode	QIO 80MHz (default, or leave unchanged)
Port	      Select the UART COM port (the one with a USB-to-Serial chip)

*/
// =============================================================================================================================

//------------------------------------------------------------------------------              //
// ESP32 Includes defines and initialisations
//--------------------------------------------
                      #if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL (4, 2, 0)            // Use EdSoftLED with ESP32 compiler until V3.2.0. Neopixel crashes>
#define USEEDSOFTLED
                      #endif
                      #ifdef USEEDSOFTLED
#include <EdSoftLED.h>         // https://github.com/ednieuw/EdSoftLED for LED strip WS2812 or SK6812 
                      #else
#include <Adafruit_NeoPixel.h> // https://github.com/adafruit/Adafruit_NeoPixel   for LED strip WS2812 or SK6812
                      #endif
#include <Preferences.h>
#include <NimBLEDevice.h>      // For BLE communication. !!!Use NimBLE version 2.x.x  https://github.com/h2zero/NimBLE-Arduino
#include <WiFi.h>              // Used for web page 
#include <WebServer.h>         // Used for web page 
#include "esp_sntp.h"          // for NTP
#include "esp_wps.h"           // For WPS
#include <Update.h>            // For Over-the-Air (OTA)
#include <ESPmDNS.h>           // To show BLEname in router
#include <DNSServer.h>         // For the web page to enter SSID and password of the WIFI router 
#include <Wire.h>              // 
#include <RTClib.h>            // Used for connected DS3231 RTC // Reference https://adafruit.github.io/RTClib/html/class_r_t_c___d_s3231.html
#include <Encoder.h>           // For rotary encoder
#include <Keypad.h>            // For 3x1 membrane keypad instead of rotary encoder by Mark Stanley & Alexander Brevig 

//------------------------------------------------------------------------------              //
// SPIFFS storage
//--------------------------------------------
Preferences FLASHSTOR;

//------------------------------------------------------------------------------              //
// PIN Assigments for Nano ESP32 S3 DevKitC 1
//------------------------------------------------------------------------------ 
 
enum DigitalPinAssignments {      // Digital hardware constants ATMEGA 328 ----
 SERRX        = 44,               // D1 Connects to Bluetooth TX
 SERTX        = 43,               // D0 Connects to Bluetooth RX
 encoderPinB  = 4,                // D2 left (labeled CLK on decoder)no interrupt pin (Use GPIO pin numbering for rotary encoder lib)  
 encoderPinA  = 5,                // D3 right (labeled DT on decoder)on interrupt pin
 clearButton  = 6,                // D4 switch (labeled SW on decoder)
 LED_PIN      = 48,               // D5 / GPIO 8 Pin to control colour SK6812/WS2812 LEDs (replace D5 with 8 for NeoPixel lib)
 PCB_LED_D09  = 10,               // D9
 PCB_LED_D10  = 11,               // D10
 secondsPin   = 13,               // D13  GPIO48 (#ifdef LED_BUILTIN  #undef LED_BUILTIN #define LED_BUILTIN 48 #endif)
 };
 
enum AnaloguePinAssignments {     // Analogue hardware constants ----
 EmptyA0      = 10,               // Empty
 EmptyA1      = 11,               // Empty
 PhotoCellPin = 12,               // LDR pin
 OneWirePin   = 13,               // OneWirePin
 SDA_pin      = 8,                // SDA pin
 SCL_pin      = 9,                // SCL pin
 EmptyA6      = 16,               // Empty
 EmptyA7     =  17};              // Empty


//------------------------------------------------------------------------------              //
// LED
//------------------------------------------------------------------------------
// 
// Create a mutex (semaphore) to protect LED updates
//SemaphoreHandle_t ledMutex;

const uint32_t  NUM_LEDS = 1; 

/*
Adafruit_NeoPixel LEDstrip;
Adafruit_NeoPixel LED6812strip = Adafruit_NeoPixel(NUM_LEDS, LED_PIN, NEO_GRBW + NEO_KHZ800); // NEO_RGBW
Adafruit_NeoPixel LED2812strip = Adafruit_NeoPixel(NUM_LEDS, LED_PIN, NEO_GRB  + NEO_KHZ800); // NEO_RGB NEO_GRB
*/
                     #ifdef USEEDSOFTLED
EdSoftLED LEDstrip ;//    = EdSoftLED();                                                         // Use EdSoftLED with ESP32 compiler V3.x.x. Neopixel crashes
EdSoftLED LED6812strip = EdSoftLED(NUM_LEDS, LED_PIN, SK6812WRGB);
EdSoftLED LED2812strip = EdSoftLED(NUM_LEDS, LED_PIN, WS2812RGB);
                      #else

Adafruit_NeoPixel LEDstrip;
Adafruit_NeoPixel LED6812strip = Adafruit_NeoPixel(NUM_LEDS, LED_PIN, NEO_GRBW + NEO_KHZ800); // NEO_RGBW
Adafruit_NeoPixel LED2812strip = Adafruit_NeoPixel(NUM_LEDS, LED_PIN, NEO_GRB  + NEO_KHZ800); // NEO_RGB NEO_GRB
                      #endif
// #define MCULEDPIN 9
// Adafruit_NeoPixel MCUled = Adafruit_NeoPixel(1, MCULEDPIN, NEO_GRB + NEO_KHZ800);  //NEO_RGB NEO_GRB

//------------------------------------------------------------------------------              //
const uint32_t black    = 0x000000, darkorange    = 0xFF8C00, red        = 0xFF0000, chartreuse   = 0x7FFF00;
const uint32_t brown    = 0x503000, cyberyellow   = 0xFFD300, orange     = 0xFF8000; 
const uint32_t yellow   = 0xFFFF00, cadmiumyellow = 0xFFF600, dyellow    = 0xFFAA00, chromeyellow = 0xFFA700;
const uint32_t green    = 0x00FF00, brightgreen   = 0x66FF00, apple      = 0x80FF00, grass        = 0x00FF80;  
const uint32_t amaranth = 0xE52B50, edamaranth    = 0xFF0050, amber      = 0xFF7E00;
const uint32_t marine   = 0x0080FF, darkviolet    = 0x800080, pink       = 0xFF0080, purple       = 0xFF00FF; 
const uint32_t blue     = 0x0000FF, cerulean      = 0x007BA7, sky        = 0x00FFFF, capri        = 0x00BFFF;
const uint32_t edviolet = 0X7500BC, frenchviolet  = 0X8806CE, coquelicot = 0xFF3800;
const uint32_t greenblue= 0x00F2A0, hotmagenta    = 0xFF00BF, dodgerblue = 0x0073FF, screamingreen= 0x70FF70;
      uint32_t white    = 0xFFFFFF, lgray         = 0x666666, wgray      = 0xAAAAAA;
      uint32_t gray     = 0x333333, dgray         = 0x222222;  

